# config.py
import numpy as np

# Геометрия системы
m = 6                      # Количество стопок
n = 5                      # Количество колец в стопке
radii = np.full(n, 0.035)  # Радиусы колец (м)
gaps = np.array([0.01, 0.001, 0.01, 0.001])  
# gaps = np.array([6.92007100e-02, 3.83079306e-03, 3.76441147e-02, 3.99634670e-03])  

"""
S = 1.14563838e-02
k1, k2, k3 = 3.29859053e-02, 4.11406771e-02, 3.78943057e-02

d1 = S * k1
d2 = (S - d1) * k2
d3 = (S - d1 - d2) * k3
d4 = S - d1 - d2 - d3

gaps = np.array([d1, d2, d3, d4])
"""
N_seg = 512                # Дискретизация кольца
R_domain = 0.6*0.008           # Радиус области, в которой оценивается однородность поля (м)

# Физические параметры
r_ohm = 3.73e-4            # Активное сопротивление кольца
U_0 = 200                  # Амплитуда напряжения
A = 0.08                   # Расстояние от центра до первой стопки
phi_0 = 0                  # Начальная фаза
frequency_MHz = 68.5       # Частота в МГц
omega = 2 * np.pi * frequency_MHz * 1e6
L_self = 1.5e-7            # Собственная индуктивность кольца
C = np.full(n*m, 23.7e-12)  # Емкость колец (Фарады)
# C = np.full(n*m, 1.95239801e-11)  # Емкость колец

def get_fixed_params():
    return {
        'n': n, 'm': m, 'R': radii, 'delta': gaps, 'N': N_seg,
        'r_ohm': r_ohm, 'L_own': L_self, 'U_0': U_0, 'A': A, 'phi': phi_0,
        'omega': omega
    }